""" Flask
Название курса: Flask
Количество уроков: 10
Продолжительность в часах: 10 часов
Продолжительность в днях: 10 дней
Описание курса
Курс Flask состоит из 10 логически взаимосвязанных уроков, на которых учащиеся применяют
на практике теоретические знания, используя python и Flask для построения RESTful API.
На этом курсе вы познакомитесь с Flask, получите необходимые теоретические и практические
знания для построения собственного приложения или для поддержки уже существующего
проекта. На протяжении всего курса мы будем строить веб-приложение, которое в дальнейшем
будет вашим базисом, на который можно ссылаться. Кроме того, мы обсудим все подводные
камни, на которые может «наступить» новичок и также поговорим о лучших практиках, которые
используются в разработке веб-приложений с помощью Flask Fr. По окончанию курса, вы
сможете реализовать любую вашу идею для проекта, упаковать его в контейнер и развернуть на
любом хостинге, также узнаете, что такое ORM и для чего она нужна, как можно ускорить ваше
приложение и как быть уверенным, что новые изменения, добавленные в код, не сломали всю
систему.

https://nnmclub.to/forum/viewtopic.php?t=1463023
"""